In [1]:
import numpy as np
import pandas as pd

## Multiple Indexed Series

In [2]:
#bad way 
index = [('California', 2000), ('California', 2010),
         ('New York', 2000), ('New York', 2010),
         ('Texas', 2000), ('Texas', 2010)]
populations = [33871648, 37253956,
               18976457, 19378102,
               20851820, 25145561]
pop = pd.Series(populations,index=index)
pop

(California, 2000)    33871648
(California, 2010)    37253956
(New York, 2000)      18976457
(New York, 2010)      19378102
(Texas, 2000)         20851820
(Texas, 2010)         25145561
dtype: int64

In [3]:
#slicing 
pop[('California',2010):('Texas',2000)]

(California, 2010)    37253956
(New York, 2000)      18976457
(New York, 2010)      19378102
(Texas, 2000)         20851820
dtype: int64

In [4]:
#selcting data with year 2010
pop[[i for i in pop.index if i[1] == 2010]]

(California, 2010)    37253956
(New York, 2010)      19378102
(Texas, 2010)         25145561
dtype: int64

In [5]:
#better way : MultiIndex 
#printing the index using multiindex

index = pd.MultiIndex.from_tuples(index)
index

MultiIndex(levels=[['California', 'New York', 'Texas'], [2000, 2010]],
           labels=[[0, 0, 1, 1, 2, 2], [0, 1, 0, 1, 0, 1]])

In [6]:
#reindexing of data 
pop = pop.reindex(index)
pop

California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [7]:
#panda slicing to acces using multi index
pop[:,2010]

California    37253956
New York      19378102
Texas         25145561
dtype: int64

## MultiIndex as extra dimension

In [8]:
#using unstack method to convert multiindexed data into dataframe
pop_df = pop.unstack()
pop_df

                2000      2010
California  33871648  37253956
New York    18976457  19378102
Texas       20851820  25145561

In [9]:
#stack operation to convert back to series format
pop_df.stack()

California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [10]:
#adding an extra dimension
pop_df = pd.DataFrame({'total': pop,
                       'under18': [9267089, 9284094,
                                   4687374, 4318033,
                                   5906301, 6879014]})
pop_df

                    total  under18
California 2000  33871648  9267089
           2010  37253956  9284094
New York   2000  18976457  4687374
           2010  19378102  4318033
Texas      2000  20851820  5906301
           2010  25145561  6879014

In [11]:
f_u18 = pop_df['under18']/pop_df['total']
f_u18.unstack()

                2000      2010
California  0.273594  0.249211
New York    0.247010  0.222831
Texas       0.283251  0.273568

## Methods of MultiIndex creation

In [12]:
#straight forward method for dataframe 
df = pd.DataFrame(np.random.rand(4, 2),
                  index=[['a', 'a', 'b', 'b'], [1, 2, 1, 2]],
                  columns=['data1', 'data2'])
df

        data1     data2
a 1  0.472996  0.054075
  2  0.568782  0.185979
b 1  0.136132  0.586771
  2  0.250155  0.310922

In [13]:
#straightforward for series by simply definig indexes 
data = {('California', 2000): 33871648,
        ('California', 2010): 37253956,
        ('Texas', 2000): 20851820,
        ('Texas', 2010): 25145561,
        ('New York', 2000): 18976457,
        ('New York', 2010): 19378102}
pd.Series(data)

California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [14]:
#by using a class method to create multiindex from array list 
pd.MultiIndex.from_arrays([['a','a','b','b'],[1,2,1,2]])

MultiIndex(levels=[['a', 'b'], [1, 2]],
           labels=[[0, 0, 1, 1], [0, 1, 0, 1]])

In [15]:
#using class and tupples 
pd.MultiIndex.from_tuples([('a', 1), ('a', 2), ('b', 1), ('b', 2)])

MultiIndex(levels=[['a', 'b'], [1, 2]],
           labels=[[0, 0, 1, 1], [0, 1, 0, 1]])

In [16]:
#using class method and from products
pd.MultiIndex.from_product([['a', 'b'], [1, 2]])

MultiIndex(levels=[['a', 'b'], [1, 2]],
           labels=[[0, 0, 1, 1], [0, 1, 0, 1]])

In [18]:
#naming multiIndex
pop.index.names=['state','year']
pop

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [22]:
#hieratchical indices and columns 
index = pd.MultiIndex.from_product([[2013,2014],[1,2]],names=['year','visit'])
columns = pd.MultiIndex.from_product([['Bob','Guido','Sue'],['HR','Temp']],names=['subject','type'])

#mocking some data 
data = np.round(np.random.randn(4,6),1)
data[:,::2]*10
data += 37

#creating a dataframe 
health_data = pd.DataFrame(data,index=index,columns=columns)
health_data

subject      Bob       Guido         Sue
type          HR  Temp    HR  Temp    HR  Temp
year visit
2013 1      36.0  37.4  36.6  36.9  37.6  39.0
     2      36.5  34.9  37.4  36.0  35.5  35.3
2014 1      37.3  35.3  37.4  36.4  37.6  35.6
     2      37.1  37.5  37.6  36.6  38.0  35.8

In [23]:
#accessing a data from health_data df 
health_data['Guido']

type          HR  Temp
year visit
2013 1      36.6  36.9
     2      37.4  36.0
2014 1      37.4  36.4
     2      37.6  36.6

## Indexing and Slicing MultiIndex

In [25]:
#slicing using particular data 
pop['California',2000]

33871648

In [26]:
#slicing based on sorted list 
pop[:,2000]

state
California    33871648
New York      18976457
Texas         20851820
dtype: int64

In [28]:
#particular slicing 
pop.loc['California':'New York']

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
dtype: int64

In [29]:
#slicing based on boolean mask
pop[pop > 22000000]

state       year
California  2000    33871648
            2010    37253956
Texas       2010    25145561
dtype: int64

In [31]:
#Fancy Indexing 
pop[['Texas','California']]

state       year
California  2000    33871648
            2010    37253956
Texas       2000    20851820
            2010    25145561
dtype: int64

In [33]:
#slicing a dataframe 
health_data['Bob','HR']

year  visit
2013  1        36.0
      2        36.5
2014  1        37.3
      2        37.1
Name: (Bob, HR), dtype: float64

In [35]:
#indexing an array explictly 
health_data.iloc[:2,:2]

subject      Bob
type          HR  Temp
year visit
2013 1      36.0  37.4
     2      36.5  34.9

In [36]:
#slicing implictly
health_data.loc[:,('Bob','HR')]

year  visit
2013  1        36.0
      2        36.5
2014  1        37.3
      2        37.1
Name: (Bob, HR), dtype: float64

In [43]:
#using a slicing index
idx = pd.IndexSlice
health_data.loc[idx[:,1],idx[:,'HR']]

subject      Bob Guido   Sue
type          HR    HR    HR
year visit
2013 1      36.0  36.6  37.6
2014 1      37.3  37.4  37.6

## Rearranging Multi-Indices

In [44]:
#creating an index with unsorted values 
index = pd.MultiIndex.from_product([['a','c','b'],[1,2]])
data = pd.Series(np.random.rand(6),index=index)
data.index.names = ['char','int']
data

char  int
a     1      0.133320
      2      0.418050
c     1      0.308215
      2      0.662625
b     1      0.717263
      2      0.513057
dtype: float64

In [47]:
#sorting indexes of the dataframe with sort index method 
data = data.sort_index()
data

char  int
a     1      0.133320
      2      0.418050
b     1      0.717263
      2      0.513057
c     1      0.308215
      2      0.662625
dtype: float64

In [48]:
data['a':'b']

char  int
a     1      0.133320
      2      0.418050
b     1      0.717263
      2      0.513057
dtype: float64

In [49]:
#unstacking the data along 0 axis 
pop.unstack(level=0)

state  California  New York     Texas
year
2000     33871648  18976457  20851820
2010     37253956  19378102  25145561

In [50]:
#unstacking the data along 1 axis
pop.unstack(level=1)

year            2000      2010
state
California  33871648  37253956
New York    18976457  19378102
Texas       20851820  25145561

In [51]:
#unstacking the data 
pop.unstack() #unstacking to completely create a new dataframe

year            2000      2010
state
California  33871648  37253956
New York    18976457  19378102
Texas       20851820  25145561

In [55]:
#stacking the df to form a series 
pop.unstack().stack()

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

## Setting and Resetting the index

In [56]:
#resetting the index 
pop_flat = pop.reset_index(name='population')
pop_flat

        state  year  population
0  California  2000    33871648
1  California  2010    37253956
2    New York  2000    18976457
3    New York  2010    19378102
4       Texas  2000    20851820
5       Texas  2010    25145561

In [57]:
#setting the index 
pop_flat = pop_flat.set_index(['state','year'])
pop_flat

                 population
state      year
California 2000    33871648
           2010    37253956
New York   2000    18976457
           2010    19378102
Texas      2000    20851820
           2010    25145561

## Data Aggregation on Multi-Indices

In [60]:
#mean of level year 
data_mean = health_data.mean(level='year')
data_mean

subject    Bob        Guido           Sue
type        HR   Temp    HR   Temp     HR   Temp
year
2013     36.25  36.15  37.0  36.45  36.55  37.15
2014     37.20  36.40  37.5  36.50  37.80  35.70

In [64]:
#mean of data along first axis
data_mean.mean(axis=1,level='type')

type    HR       Temp
year
2013  36.6  36.583333
2014  37.5  36.200000